
# tap repositories and their packages

tap 'homebrew/core'
brew 'ack'
brew 'act'
brew 'aom'
brew 'aribb24'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'berkeley-db@5'
brew 'bottom'
brew 'brotli'
brew 'bzip2'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'capstone'
brew 'certifi'
brew 'cffi'
brew 'cjson'
brew 'cmatrix'
brew 'coreutils'
brew 'cowsay'
brew 'cryptography'
brew 'curl'
brew 'dav1d'
brew 'deno'
brew 'dolt'
brew 'doltgres'
brew 'dtc'
brew 'duf'
brew 'expat'
brew 'eza'
brew 'fastfetch'
brew 'fd'
brew 'ffmpeg'
brew 'ffmpegthumbnailer'
brew 'flac'
brew 'fnm'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'gitui'
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gpgme'
brew 'graphite2'
brew 'harfbuzz'
brew 'helix'
brew 'highway'
brew 'htop'
brew 'icu4c@75'
brew 'icu4c@77'
brew 'ifstat'
brew 'imagemagick'
brew 'imath'
brew 'jasper'
brew 'jbig2dec'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'k6'
brew 'krb5'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libb2'
brew 'libbluray'
brew 'libde265'
brew 'libdeflate'
brew 'libedit'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libheif'
brew 'libice'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'liblqr'
brew 'libmicrohttpd'
brew 'libnghttp2'
brew 'libogg'
brew 'libomp'
brew 'libpng'
brew 'libpsl'
brew 'libraw'
brew 'librist'
brew 'libsamplerate'
brew 'libslirp'
brew 'libsm'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtommath'
brew 'libtool'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxmu'
brew 'libxrender'
brew 'libxt'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lld@19'
brew 'llvm'
brew 'llvm@19'
brew 'lnav'
brew 'lpeg'
brew 'lua'
brew 'luajit'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mbedtls'
brew 'mcfly'
brew 'mpdecimal'
brew 'mpg123'
brew 'ncurses'
brew 'neonctl'
brew 'neovim'
brew 'nettle'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'ollama'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pinentry'
brew 'pipx'
brew 'pixman'
brew 'pkgconf'
brew 'poppler'
brew 'popt'
brew 'postgresql@15'
brew 'pycparser'
brew 'python'
brew 'python-packaging'
brew 'python-setuptools'
brew 'python-tk'
brew 'python@3.12'
brew 'qemu'
brew 'rav1e'
brew 'readline'
brew 'ripgrep'
brew 'rsync'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'rust'
brew 'sdl2'
brew 'sevenzip'
brew 'shared-mime-info'
brew 'sheldon'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'starship'
brew 'stow'
brew 'svt-av1'
brew 'tcl-tk'
brew 'terraform'
brew 'tesseract'
brew 'theora'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'turso'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'vde'
brew 'vim'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xclip'
brew 'xorgproto'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'yazi'
brew 'yq'
brew 'z3'
brew 'zellij'
brew 'zeromq'
brew 'zig'
brew 'zimg'
brew 'zlib'
brew 'zoxide'
brew 'zsh'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'balenaetcher'
cask 'bruno'
cask 'caffeine'
cask 'calibre'
cask 'canva'
cask 'discord'
cask 'docker-desktop'
cask 'evkey'
cask 'firefox'
cask 'font-cascadia-code'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-nerd-font'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'fork'
cask 'ghostty'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite-no-mail'
cask 'logi-options+'
cask 'logitech-g-hub'
cask 'messenger'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'miro'
cask 'notion'
cask 'numi'
cask 'obs'
cask 'paintbrush'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tableplus'
cask 'via'
cask 'vial'
cask 'visual-studio-code'
cask 'zalo'
cask 'zed'
cask 'zoom'

tap 'homebrew/bundle'

tap 'homebrew/command-not-found'

tap 'homebrew/services'

tap 'atomicjar/tap'
cask 'testcontainers-desktop'

tap 'axiomhq/tap'
brew 'axiom'

tap 'beeftornado/rmtree'

tap 'buo/cask-upgrade'

tap 'cowsay-org/cowsay'

tap 'github/gh'

tap 'hashicorp/tap'

tap 'libsql/sqld'
brew 'sqld'

tap 'localstack/tap'
brew 'localstack-cli'

tap 'nikolaeu/numi'
brew 'numi-cli'

tap 'oven-sh/bun'
brew 'bun'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'tursodatabase/tap'

# App Store applications
mas '1Password for Safari (8.10.82)', id: 1569813296
mas 'Amazon Kindle (7.35)', id: 302584613
mas 'Bear (2.4.5)', id: 1091189122
mas 'Brother iPrint&Scan (12.2.1)', id: 1193539993
mas 'GarageBand (10.4.12)', id: 682658836
mas 'Genki Arcade (1.3.2)', id: 1555925018
mas 'iMovie (10.4.3)', id: 408981434
mas 'Keynote (14.4)', id: 409183694
mas 'Notability (14.12.4)', id: 360593530
mas 'Numbers (14.4)', id: 409203825
mas 'Pages (14.4)', id: 409201541
