
# tap repositories and their packages

tap 'homebrew/core'
brew 'ack'
brew 'act'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'bottom'
brew 'bzip2'
brew 'certifi'
brew 'cmatrix'
brew 'coreutils'
brew 'cowsay'
brew 'curl'
brew 'deno'
brew 'dolt'
brew 'doltgres'
brew 'duf'
brew 'expat'
brew 'eza'
brew 'fastfetch'
brew 'fd'
brew 'ffmpegthumbnailer'
brew 'fnm'
brew 'fzf'
brew 'gh'
brew 'ghostscript'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'gitui'
brew 'go'
brew 'helix'
brew 'htop'
brew 'ifstat'
brew 'imagemagick'
brew 'jq'
brew 'kanata'
brew 'k6'
brew 'libedit'
brew 'libffi'
brew 'libiconv'
brew 'libpsl'
brew 'lnav'
brew 'mas'
brew 'mcfly'
brew 'neonctl'
brew 'neovim'
brew 'ollama'
brew 'openssl@1.1'
brew 'perl'
brew 'pipx'
brew 'poppler'
brew 'postgresql@15'
brew 'python-tk'
brew 'qemu'
brew 'ripgrep'
brew 'rsync'
brew 'rust'
brew 'sevenzip'
brew 'sheldon'
brew 'starship'
brew 'stow'
brew 'tealdeer'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'xclip'
brew 'yq'
brew 'zellij'
brew 'zig'
brew 'zlib'
brew 'zoxide'
brew 'zsh'

tap 'homebrew/cask'
cask '1password'
cask '1password-cli'
cask 'balenaetcher'
cask 'beekeeper-studio'
cask 'bruno'
cask 'caffeine'
cask 'calibre'
cask 'canva'
cask 'discord'
cask 'docker-desktop'
cask 'evkey'
cask 'firefox'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'fork'
cask 'ghostty'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'jumpcloud-password-manager'
cask 'keymapp'
cask 'logi-options+'
cask 'logitech-g-hub'
cask 'messenger'
cask 'notion'
cask 'obs'
cask 'paintbrush'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'via'
cask 'vial'
cask 'visual-studio-code'
cask 'zed'

tap 'homebrew/bundle'

tap 'homebrew/command-not-found'

tap 'homebrew/services'

tap 'atomicjar/tap'
cask 'atomicjar/tap/testcontainers-desktop'

tap 'axiomhq/tap'
cask 'axiomhq/tap/axiom'

tap 'beeftornado/rmtree'

tap 'buo/cask-upgrade'

tap 'cowsay-org/cowsay'

tap 'github/gh'

tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

tap 'libsql/sqld'

tap 'localstack/tap'
brew 'localstack/tap/localstack-cli'

tap 'nikitabobko/tap'
cask 'nikitabobko/tap/aerospace'

tap 'nikolaeu/numi'
brew 'nikolaeu/numi/numi-cli'

tap 'oven-sh/bun'
brew 'oven-sh/bun/bun'

tap 'rcmdnk/file'
brew 'rcmdnk/file/brew-file'

tap 'sst/tap'
brew 'sst/tap/opencode'

tap 'tursodatabase/tap'
brew 'tursodatabase/tap/turso'

# App Store applications
mas '1Password for Safari (8.11.12)', id: 1569813296
mas 'Amazon Kindle (7.43)', id: 302584613
mas 'Bear (2.6.3)', id: 1091189122
mas 'Brother iPrint&Scan (13.3.0)', id: 1193539993
mas 'GarageBand (10.4.12)', id: 682658836
mas 'Genki Arcade (1.3.3)', id: 1555925018
mas 'iMovie (10.4.3)', id: 408981434
mas 'Keynote (14.4)', id: 409183694
mas 'Notability (15.0.14)', id: 360593530
mas 'Numbers (14.4)', id: 409203825
mas 'Pages (14.4)', id: 409201541
