tap "aws/tap"
tap "axiomhq/tap"
tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "cjbassi/gotop"
tap "github/gh"
tap "goodwithtech/r"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "planetscale/tap"

brew "ack"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "aws/tap/aws-sam-cli"
brew "awscli"
brew "axiomhq/tap/axiom"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bzip2"
brew "cjbassi/gotop/gotop"
brew "cmatrix"
brew "colima"
brew "coreutils"
brew "cowsay"
brew "deno"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "exa"
brew "exercism"
brew "expat"
brew "figlet"
brew "fnm"
brew "fortune"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gmp"
brew "gnupg", link: false
brew "gnutls"
brew "go"
brew "hashicorp/tap/terraform"
brew "htop"
brew "ifstat"
brew "imagemagick"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "libedit"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libiconv"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "libpsl"
brew "libtool"
brew "libunistring"
brew "libyaml"
brew "lnav"
brew "lolcat"
brew "mas"
brew "ncurses"
brew "neofetch"
brew "neonctl"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "pcre"
brew "pcre2"
brew "perl"
brew "pkg-config"
brew "planetscale/tap/pscale"
brew "popt"
brew "python-tk@3.11"
brew "python@3.10"
brew "python@3.8", link: false
brew "python@3.9", link: false
brew "readline"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "sqlite"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "whalebrew"
brew "xz"
brew "yq"
brew "zlib"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "arc"
cask "authy"
cask "brave-browser"
cask "calibre"
cask "canva"
cask "chromium"
cask "discord"
cask "evkey"
cask "firefox"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "kindle"
cask "logi-options-plus"
cask "logitech-g-hub"
cask "maccy"
cask "messenger"
cask "microsoft-office"
cask "miro"
cask "notion"
cask "obs"
cask "paintbrush"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "via"
cask "visual-studio-code"
cask "zalo"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Brother iPrint&Scan", id: 1193539993
mas "GarageBand", id: 682658836
mas "Genki Arcade", id: 1555925018
mas "Pages", id: 409201541
mas "iMovie", id: 408981434

vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "DavidAnson.vscode-markdownlint"
vscode "EditorConfig.EditorConfig"
vscode "GitHub.codespaces"
vscode "GitHub.vscode-pull-request-github"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "MehediDracula.php-namespace-resolver"
vscode "Orta.vscode-twoslash-queries"
vscode "PKief.material-icon-theme"
vscode "PKief.material-product-icons"
vscode "Prisma.prisma"
vscode "Thog.vscode-asl"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.dingo-vscode"
vscode "WallabyJs.quokka-vscode"
vscode "WallabyJs.wallaby-extension-pack"
vscode "WallabyJs.wallaby-vscode"
vscode "XadillaX.viml"
vscode "ZixuanChen.vitest-explorer"
vscode "adpyke.codesnap"
vscode "apollographql.vscode-apollo"
vscode "bbenoist.vagrant"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "jaspernorth.vscode-pigments"
vscode "junstyle.php-cs-fixer"
vscode "leighlondon.eml"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "msjsdiag.vscode-react-native"
vscode "neilbrayfield.php-docblocker"
vscode "octref.vetur"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yoavbls.pretty-ts-errors"
vscode "zobo.php-intellisense"