tap "axiomhq/tap"
tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "tursodatabase/tap"

brew "ack"
brew "autoconf"
brew "automake"
brew "aws-sam-cli"
brew "awscli"
brew "axiomhq/tap/axiom"
brew "bash"
brew "bash-completion"
brew "bat"
brew "broot"
brew "bzip2"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "deno"
brew "dolt"
brew "duf"
brew "expat"
brew "eza"
brew "fnm"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gmp"
brew "gnupg", link: false
brew "gnutls"
brew "go"
brew "gotop"
brew "hashicorp/tap/terraform"
brew "htop"
brew "ifstat"
brew "imagemagick"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "libedit"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libheif"
brew "libiconv"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "libpsl"
brew "libtool"
brew "libunistring"
brew "libyaml"
brew "lnav"
brew "mas"
brew "mcfly"
brew "ncurses"
brew "neofetch"
brew "neonctl"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "oven-sh/bun/bun"
brew "pcre"
brew "pcre2"
brew "perl"
brew "pipx"
brew "pkg-config"
brew "popt"
brew "postgresql@15", link: true
brew "python-tk"
brew "python"
brew "qemu"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "tursodatabase/tap/turso"
brew "vim"
brew "wget"
brew "xz"
brew "yq"
brew "zlib"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "arc"
cask "balenaetcher"
cask "calibre"
cask "canva"
cask "discord"
cask "docker"
cask "evkey"
cask "firefox"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "kindle"
cask "logi-options-plus"
cask "logitech-g-hub"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "miro"
cask "notion"
cask "obs"
cask "paintbrush"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "zalo"
cask "zed"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Brother iPrint&Scan", id: 1193539993
mas "GarageBand", id: 682658836
mas "Genki Arcade", id: 1555925018
mas "Keynote", id: 409183694
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "iMovie", id: 408981434

vscode "adpyke.codesnap"
vscode "apollographql.vscode-apollo"
vscode "astro-build.astro-vscode"
vscode "bbenoist.vagrant"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "heybourn.headwind"
vscode "jaspernorth.vscode-pigments"
vscode "junstyle.php-cs-fixer"
vscode "leighlondon.eml"
vscode "mehedidracula.php-namespace-resolver"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-playwright.playwright"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "neilbrayfield.php-docblocker"
vscode "octref.vetur"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "prisma.prisma"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "thog.vscode-asl"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.dingo-vscode"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-extension-pack"
vscode "wallabyjs.wallaby-vscode"
vscode "william-voyek.vscode-nginx"
vscode "xadillax.viml"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yoavbls.pretty-ts-errors"
vscode "zobo.php-intellisense"