tap "atomicjar/tap"
tap "axiomhq/tap"
tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "libsql/sqld"
tap "nikolaeu/numi"
tap "oven-sh/bun"
tap "tursodatabase/tap"

brew "ack"
brew "autoconf"
brew "automake"
brew "aws-sam-cli"
brew "awscli"
brew "axiomhq/tap/axiom"
brew "bash"
brew "bash-completion"
brew "bat"
brew "broot"
brew "bzip2"
brew "cmatrix"
brew "commitizen"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "deno"
brew "dnsmasq"
brew "dolt"
brew "duf"
brew "expat"
brew "eza"
brew "fastfetch"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gettext"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gmp"
brew "gnupg", link: false
brew "gnutls"
brew "go"
brew "gotop"
brew "hashicorp/tap/terraform"
brew "htop"
brew "ifstat"
brew "imagemagick"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "libedit"
brew "libffi"
brew "libgit2"
brew "libgpg-error"
brew "libiconv"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "libpsl"
brew "libtool"
brew "libunistring"
brew "libyaml"
brew "lnav"
brew "make"
brew "mas"
brew "mcfly"
brew "mysql-client"
brew "ncurses"
brew "neonctl"
brew "neovim"
brew "nginx"
brew "nikolaeu/numi/numi-cli"
brew "node"
brew "ollama"
brew "openssl@1.1"
brew "oven-sh/bun/bun"
brew "pcre"
brew "pcre2"
brew "perl"
brew "php"
brew "pipx"
brew "pkg-config"
brew "popt"
brew "postgresql@15", link: true
brew "pre-commit"
brew "python"
brew "python-tk"
brew "qemu"
brew "readline"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "sqlite"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "tursodatabase/tap/turso"
brew "vim"
brew "wget"
brew "yq"
brew "zlib"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "arc"
cask "balenaetcher"
cask "caffeine"
cask "calibre"
cask "canva"
cask "dbngin"
cask "discord"
cask "docker"
cask "evkey"
cask "fantastical"
cask "firefox"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "gather"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "herd"
cask "kindle"
cask "linear-linear"
cask "logi-options-plus"
cask "logitech-g-hub"
cask "loom"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro"
cask "nosql-workbench"
cask "notion"
cask "numi"
cask "obs"
cask "paintbrush"
cask "popsql"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tableplus"
cask "testcontainers-desktop"
cask "tunnelblick"
cask "visual-studio-code"
cask "warp"
cask "zalo"
cask "zed"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Brother iPrint&Scan", id: 1193539993
mas "GarageBand", id: 682658836
mas "Genki Arcade", id: 1555925018
mas "Keynote", id: 409183694
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "iMovie", id: 408981434
